#include <iostream>
#include <vector>
#include <string>
#include <cstring> 
#include <queue>
#include <utility>

/*
 	现在你有一个类MAP_BASE，请编写他的子类，继承于MAP_BASE
 	可以看到map_in是一张地图，定义.是空地，#是障碍物，现在有一个的机器人想从左上角到达右下角，请在子类中写一个函数完成这件事情
 	要求：1.将机器人中心走过的路用C表示出来并输出整个地图
		  2.机器人是四向移动的，即只能向上下左右移动
      	  3.机器人走过的路线为所有可行的路线中最短的
	
	注意：答案不唯一，只要输出一种答案就可
	加分条件：现实中机器人是有大小的，不可能完全让中心靠墙移动，现在假设机器人需要3x3的空地才能安全移动，请给出能让机器人安全移动的路径

	示例：

	#############################	#############################			#############################
	#..............###..........#	#.C............###..........#			#.C............###..........#
	#........###................#	#.C......###................#			#.C......###................#
	#.........................###	#.C.......................###			#.C.......................###	
	#.........................###	#.CCCCCCCCCCCCCCCCCC......###			#.C.......................###
	#....................########	#..................C.########			#.C..................########
	#.....#####.................#	#.....#####........C........#			#.C...#####.................#
	#...........................#	#..................CCCCCCCC.#			#.CCCCCCCCCCCCCCCCCCCCCCCCC.#
	#...........................#	#...........................#			#...........................#
	#############################中	#############################是安全的而	 #############################是不安全的因为通过了2x2的空地
	同时
	#############################	           #############################
	#.C............###..........#	           #.C............###..........#
	#.C......###................#	           #.C......###................#
	#.C.......................###	           #.C.......................###	
	#.CCCCCCCCCCCCCC..........###	           #.CCCCCCCCCCCC.CCCCC......###
	#..............C.....########	           #............C.C...C.########
	#.....#####....C............#	           #.....#####..C.C...C........#
	#..............CCCCCCCCCCCC.#	           #............CCC...CCCCCCCC.#
	#...........................#			   #...........................#
	#############################也是可行的而	#############################是不可行的因为这不是最短路

*/
class MAP_BASE
{
	public:
		MAP_BASE()
		{
			map_in = {
	        "#######################################################################",
	        "#.............................................######...........##.....#",
	        "#...........#############........................######.......#########",
	        "#...........#####...........................###...####.......##########",
	        "##.............##.............#######.................................#",
	        "###...................................................................#",
	        "#.........####................######.......................####.......#",
	        "#..........##.........#.##...................######...................#",
	        "#.....................................................................#",
	        "#.............................##................................#######",
	        "#.....................................................................#",
	        "##########.............#######..########......#########...............#",
	        "#...............................###############.......................#",
	        "#######################################################################"
			};
			std::memset(visit, false, sizeof(visit));
		}
		
		void print(std::vector<std::string> map_in)
		{
			for (const auto& line : map_in)
		        std::cout << line << '\n';
		}
	protected:
		std::vector<std::string> map_in;
		bool visit[100][100];
};

/**
*在map_in中将'.'替换成'C'表示机器人的路径。将最终的结果像示例里那样输出出来
*
* 提示：
* (1) 没有思路的同学可以先去了解一下深度优先搜索算法和广度优先搜索算法，思考应该用哪种方法。
* (2) 考虑使用队列queue数据结构
*
* 考点：
* (1) 类的使用。
* (2) 搜索算法。
*/

//IMPLEMENT YOUR CODE HERE
//前面没给std后面要写好多遍。。TAT。。。
//按理来讲初始位置应该是vector的[2][2],不知道为什么示例里给的是[1][2],我按照[2][2]写的
int dx[4]={-1,1,0,0};
int dy[4]={0,0,-1,1};
struct point//定义一个坐标点的结构体
{
	int x;
	int y;
};

class MAP_NAVI : public MAP_BASE
//继承于MAP_BASE。由于没说，默认该地图能放得下3*3机器人，且在起点和重点都能放下。(我是懒狗)
{
private:
	int Xn=static_cast<int>(map_in.size());
	int Yn=static_cast<int>(map_in[0].size());//得出地图尺寸
public:
	void bfs()
	{
		std::queue<point> q;//bfs用队列实现
		std::vector<std::vector<point>> pre(Xn, std::vector<point>(Yn, {-1, -1}));//记录前驱用来回溯画出路径
		point start{2,2},goal{Xn-3,Yn-3};//起点和终点坐标
		q.push(start);
		visit[start.x][start.y]=true;
		while(!q.empty())
		{
			point now=q.front();
			q.pop();
			if(now.x==goal.x&&now.y==goal.y) break;//到了
			for(int i=0;i<4;i++)
			{
				int nextx=now.x+dx[i];
				int nexty=now.y+dy[i];
				if(nextx<2||nextx>=Xn-2||nexty<2||nexty>=Yn-2) continue;//越界
				if(visit[nextx][nexty]) continue;//已经访问过
				if(map_in[nextx-1][nexty-1]=='#'||
					map_in[nextx-1][nexty]=='#'||
					map_in[nextx][nexty-1]=='#'||
					map_in[nextx][nexty]=='#'||
					map_in[nextx][nexty+1]=='#'||
					map_in[nextx+1][nexty-1]=='#'||
					map_in[nextx+1][nexty]=='#'||
					map_in[nextx+1][nexty+1]=='#') continue;//33小车遇到障碍物(小车中心点周围也就是实际车边缘挨个判断一遍) ps.这种判断方式写起来甚至比比循环八个方向判断都快，vscode真比沟槽的devc++好用吧
				visit[nextx][nexty]=true;
				pre[nextx][nexty]=now;
				q.push({nextx,nexty});
			}
		}
		if(visit[goal.x][goal.y]==false) std::cout<<"机器人无法从左上角到达右下角！\n";
		else
		{
			point now=goal;
			while(!(now.x==start.x&&now.y==start.y))
			{
				map_in[now.x][now.y]='C';//走过的中心点变成C
				now=pre[now.x][now.y];
			}
			map_in[start.x][start.y]='C';//显然起点也走过
			print(map_in);
		}
	}
};

int main()
{
	MAP_NAVI navi;
	navi.bfs(); 
	return 0;
}
//下附程序输出结果
// #######################################################################
// #.............................................######...........##.....#
// #.CC........#############.CCCCCCCCCCCCC..........######.......#########
// #..CC.......#####.........C...........C.....###...####.......##########
// ##..C..........##.CCCCCCCCC...#######.C...............................#
// ###.C.............C...................C...............................#
// #...C.....####.CCCC...........######..C....................####.......#
// #...C......##..C......#.##............C......######...................#
// #...C.........CC......................C...............................#
// #...CCCCCCCCCCC...............##......CCCCCCCCCCCCCCCCCCC.......#######
// #.......................................................C.............#
// ##########.............#######..########......#########.CCCCCCCCCCCCC.#
// #...............................###############.......................#
// #######################################################################